__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 5, 170, 320,  0                                            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 5, 170, 320,  0           input_1[0][0]                    
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 5, 83, 158, 3 2432        time_distributed_1[0][0]         
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 5, 83, 158, 3 128         time_distributed_2[0][0]         
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 5, 83, 158, 3 0           time_distributed_3[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 5, 83, 158, 3 0           time_distributed_4[0][0]         
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 5, 81, 156, 3 9248        time_distributed_5[0][0]         
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, 5, 81, 156, 3 128         time_distributed_6[0][0]         
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, 5, 81, 156, 3 0           time_distributed_7[0][0]         
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, 5, 81, 156, 3 0           time_distributed_8[0][0]         
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, 5, 40, 77, 64 18496       time_distributed_9[0][0]         
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, 5, 40, 77, 64 256         time_distributed_10[0][0]        
__________________________________________________________________________________________________
time_distributed_12 (TimeDistri (None, 5, 40, 77, 64 0           time_distributed_11[0][0]        
__________________________________________________________________________________________________
time_distributed_13 (TimeDistri (None, 5, 40, 77, 64 0           time_distributed_12[0][0]        
__________________________________________________________________________________________________
time_distributed_14 (TimeDistri (None, 5, 38, 75, 64 36928       time_distributed_13[0][0]        
__________________________________________________________________________________________________
time_distributed_15 (TimeDistri (None, 5, 38, 75, 64 256         time_distributed_14[0][0]        
__________________________________________________________________________________________________
time_distributed_16 (TimeDistri (None, 5, 38, 75, 64 0           time_distributed_15[0][0]        
__________________________________________________________________________________________________
time_distributed_17 (TimeDistri (None, 5, 38, 75, 64 0           time_distributed_16[0][0]        
__________________________________________________________________________________________________
time_distributed_18 (TimeDistri (None, 5, 18, 37, 12 73856       time_distributed_17[0][0]        
__________________________________________________________________________________________________
time_distributed_19 (TimeDistri (None, 5, 18, 37, 12 512         time_distributed_18[0][0]        
__________________________________________________________________________________________________
time_distributed_20 (TimeDistri (None, 5, 18, 37, 12 0           time_distributed_19[0][0]        
__________________________________________________________________________________________________
time_distributed_21 (TimeDistri (None, 5, 18, 37, 12 0           time_distributed_20[0][0]        
__________________________________________________________________________________________________
time_distributed_22 (TimeDistri (None, 5, 16, 35, 12 147584      time_distributed_21[0][0]        
__________________________________________________________________________________________________
time_distributed_23 (TimeDistri (None, 5, 16, 35, 12 512         time_distributed_22[0][0]        
__________________________________________________________________________________________________
time_distributed_24 (TimeDistri (None, 5, 16, 35, 12 0           time_distributed_23[0][0]        
__________________________________________________________________________________________________
time_distributed_25 (TimeDistri (None, 5, 16, 35, 12 0           time_distributed_24[0][0]        
__________________________________________________________________________________________________
time_distributed_26 (TimeDistri (None, 5, 14, 33, 25 295168      time_distributed_25[0][0]        
__________________________________________________________________________________________________
time_distributed_27 (TimeDistri (None, 5, 14, 33, 25 1024        time_distributed_26[0][0]        
__________________________________________________________________________________________________
time_distributed_28 (TimeDistri (None, 5, 14, 33, 25 0           time_distributed_27[0][0]        
__________________________________________________________________________________________________
time_distributed_29 (TimeDistri (None, 5, 14, 33, 25 0           time_distributed_28[0][0]        
__________________________________________________________________________________________________
time_distributed_30 (TimeDistri (None, 5, 12, 31, 25 590080      time_distributed_29[0][0]        
__________________________________________________________________________________________________
time_distributed_31 (TimeDistri (None, 5, 12, 31, 25 1024        time_distributed_30[0][0]        
__________________________________________________________________________________________________
time_distributed_32 (TimeDistri (None, 5, 12, 31, 25 0           time_distributed_31[0][0]        
__________________________________________________________________________________________________
time_distributed_33 (TimeDistri (None, 5, 12, 31, 25 0           time_distributed_32[0][0]        
__________________________________________________________________________________________________
time_flatten (TimeDistributed)  (None, 5, 95232)     0           time_distributed_33[0][0]        
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 5, 7)         0                                            
__________________________________________________________________________________________________
time_FC1 (TimeDistributed)      (None, 5, 512)       48759296    time_flatten[0][0]               
__________________________________________________________________________________________________
time_distributed_36 (TimeDistri (None, 5, 32)        256         input_2[0][0]                    
__________________________________________________________________________________________________
time_distributed_34 (TimeDistri (None, 5, 512)       0           time_FC1[0][0]                   
__________________________________________________________________________________________________
time_distributed_37 (TimeDistri (None, 5, 32)        0           time_distributed_36[0][0]        
__________________________________________________________________________________________________
time_FC2 (TimeDistributed)      (None, 5, 512)       262656      time_distributed_34[0][0]        
__________________________________________________________________________________________________
time_distributed_38 (TimeDistri (None, 5, 32)        1056        time_distributed_37[0][0]        
__________________________________________________________________________________________________
time_distributed_35 (TimeDistri (None, 5, 512)       0           time_FC2[0][0]                   
__________________________________________________________________________________________________
time_distributed_39 (TimeDistri (None, 5, 32)        0           time_distributed_38[0][0]        
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 5, 544)       0           time_distributed_35[0][0]        
                                                                 time_distributed_39[0][0]        
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          344576      concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 32)           4128        lstm_1[0][0]                     
__________________________________________________________________________________________________
output (Dense)                  (None, 1)            33          dense_5[0][0]                    
==================================================================================================
Total params: 50,549,633
Trainable params: 50,547,713
Non-trainable params: 1,920
__________________________________________________________________________________________________
